app/Controllers/AjaxRequestsController.php

public function show_notification()
{
    try {
        $userId = session()->get('userData')['userId'];
        $userBranch = session()->get('userData')['userBreanch'];
        $userAccType = session()->get('userData')['userAccountType'];

        $builder = $this->notificationModel->select('notification_table.*, certificate_comments.*, login_users.*')
            ->join("login_users", "login_users.userId = notification_table.notification_userId")
            ->join("certificate_comments", "certificate_comments.comment_id = notification_table.commentId")
            ->where('notification_branch_id', $userBranch);

        // Filter notifications based on account type view
        if ($userAccType == "ENTRY") {
            $builder->where('ENTRY_VIEW', 0);
        } elseif ($userAccType == "SIGNA") {
            $builder->where('SIGNA_VIEW', 0);
        } elseif ($userAccType == "SIGNB") {
            $builder->where('SIGNB_VIEW', 0);
        } elseif ($userAccType == "SIGNC") {
            $builder->where('SIGNC_VIEW', 0);
        }

        $notifications = $builder->orderBy('date_notified', 'DESC')->findAll();
---
SELECT `notification_table`.*, `certificate_comments`.*, `login_users`.*
FROM `notification_table`
JOIN `login_users` ON `login_users`.`userId` = `notification_table`.`notification_userId`
JOIN `certificate_comments` ON `certificate_comments`.`comment_id` = `notification_table`.`commentId`
WHERE `notification_branch_id` = '1'
AND `SIGNC_VIEW` = 0
ORDER BY `date_notified` DESC