app/Controllers/DivorceCertificateController.php

SELECT *
FROM `divorce_certificates`
JOIN `branchs_table` ON `branchs_table`.`branchId` = `divorce_certificates`.`divorcebreanch_id`
WHERE `divorce_certificates`.`divorcebreanch_id` = '1'
AND `divorce_certificates`.`divorceSIGN_A` IS NOT NULL
AND `divorce_certificates`.`divorceSIGN_B` IS NOT NULL
AND `divorce_certificates`.`divorceSIGN_C` IS NOT NULL
ORDER BY `divorce_certificates`.`divorceCertId` DESC
SELECT *
FROM `divorce_certificates`
JOIN `branchs_table` ON `branchs_table`.`branchId` = `divorce_certificates`.`divorcebreanch_id`
WHERE `divorce_certificates`.`divorcebreanch_id` = '1'
AND   (
`divorce_certificates`.`divorceSIGN_A` IS NULL
OR `divorce_certificates`.`divorceSIGN_B` IS NULL
OR `divorce_certificates`.`divorceSIGN_C` IS NULL
 )
ORDER BY `divorce_certificates`.`divorceCertId` DESC
---
    public function index()
        {

            // check if the user account is allowed to view marriage certificate activities
        if(!in_array(session()->get('userData')['userAccountType'], ['SIGNA', 'SIGNB', 'SIGNC', 'VIEWER', 'ENTRY'])){
            return redirect()->back()->with('error', 'You do not have permission to view this certificate.');
            exit();
        }

            $data['title'] = 'Users List';
            $data['passLink'] = 'certificates';

             $branchId = session()->get('userData')['branchId'];

                if($this->request->getGet('branch') && !empty($this->request->getGet('branch'))){
                    $branchId = $this->request->getGet('branch');
                }

            // Completed certificates (all signatures must be present)
            $data['branch_complete_certificate'] = $this->divorceCertificateModel
                ->join('branchs_table', 'branchs_table.branchId = divorce_certificates.divorcebreanch_id')
                ->where('divorce_certificates.divorcebreanch_id', $branchId)
                ->where('divorce_certificates.divorceSIGN_A !=', null)
                ->where('divorce_certificates.divorceSIGN_B !=', null)
                ->where('divorce_certificates.divorceSIGN_C !=', null)
                ->orderBy('divorce_certificates.divorceCertId', 'DESC')
                ->findAll();

            // Uncompleted certificates (any one signature missing)
            $data['branch_uncomplete_certificate'] = $this->divorceCertificateModel
                ->join('branchs_table', 'branchs_table.branchId = divorce_certificates.divorcebreanch_id')
                ->where('divorce_certificates.divorcebreanch_id', $branchId)
                ->groupStart()
                    ->where('divorce_certificates.divorceSIGN_A', null)
                    ->orWhere('divorce_certificates.divorceSIGN_B', null)
                    ->orWhere('divorce_certificates.divorceSIGN_C', null)
                ->groupEnd()
                ->orderBy('divorce_certificates.divorceCertId', 'DESC')
                ->findAll();

SELECT *
FROM `divorce_certificates`
JOIN `branchs_table` ON `branchs_table`.`branchId` = `divorce_certificates`.`divorcebreanch_id`
WHERE `divorce_certificates`.`divorceCertId` = '6'
ORDER BY `divorce_certificates`.`divorceCertId` DESC
SELECT *
FROM `login_users`
WHERE `login_users`.`userId` = '2'
---
public function view($certificate_id)
        {


            // check if the user account is allowed to view marriage certificate activities
        if(!in_array(session()->get('userData')['userAccountType'], ['SIGNA', 'SIGNB', 'SIGNC', 'VIEWER', 'ENTRY'])){
            return redirect()->back()->with('error', 'You do not have permission to view this certificate.');
            exit();
            }

            $data['title'] = 'Users List';
            $data['passLink'] = 'certificates';


              //divorce certificate log
           $data['certificate'] = $this->divorceCertificateModel
            ->join('branchs_table', 'branchs_table.branchId = divorce_certificates.divorcebreanch_id')
            ->where('divorce_certificates.divorceCertId', $certificate_id)
            ->orderBy('divorce_certificates.divorceCertId', 'DESC')
            ->findAll();

           $data['attachedFiles'] = $this->fileModel->select('login_users.userFullName, login_users.userId, attached_file_table.*')
                                    ->join('login_users', 'login_users.userId = attached_file_table.fileCreatedBy')
                                    ->where('fileCertificateId', $certificate_id)
                                    ->where('certificateFile_category', 'divorce')->findAll();


            if (empty($data['certificate'])) {
                return redirect()->back()->with('error', 'Certificate not found');