app/Controllers/WeddingNDivorceDashboard.php

SELECT COUNT(*) AS `numrows`
FROM `marriage_certificates`
WHERE `cert_branch` = '15'
AND   (
`SIGNA` IS NOT NULL
AND `SIGNB` IS NOT NULL
AND `SIGNC` IS NULL
 )
OR   (
`SIGNA` IS NOT NULL
AND `SIGNB` IS NULL
AND `SIGNC` IS NOT NULL
 )
OR   (
`SIGNA` IS NULL
AND `SIGNB` IS NOT NULL
AND `SIGNC` IS NOT NULL
 )
---
public function general_dashboard()
{
    $data['passLink'] = 'dashboard';

    // System-wide data
    $data['allMarriages'] = $this->marriageModel
                            ->select('marriage_certificates.*, branchs_table.branchName')
                            ->join('branchs_table', 'marriage_certificates.cert_branch = branchs_table.branchId')
                            ->orderBy('created_at', 'DESC')
                            ->findAll();

    $data['allDivorces'] = $this->divorceModel
                            ->select('divorce_certificates.*, branchs_table.branchName')
                            ->join('branchs_table', 'divorce_certificates.divorcebreanch_id = branchs_table.branchId')
                            ->orderBy('divorcecreated_at', 'DESC')
                            ->findAll();

    // Traditional certificates data
    $data['allTraditionalCerts'] = $this->traditionalModel
                                  ->select('traditionalcertificates.*, branchs_table.branchName')
                                  ->join('branchs_table', 'traditionalcertificates.tradCertBranch = branchs_table.branchId')
                                  ->orderBy('tradCertCertCreatedAt', 'DESC')
                                  ->findAll();

    // Counts for cards
    $data['totalMarriages'] = $this->marriageModel->countAll();
    $data['totalUncompletedMarriages'] = $this->marriageModel
                                            ->where('SIGNA', NULL)
                                            ->orWhere('SIGNB', NULL)
                                            ->orWhere('SIGNC', NULL)
                                            ->countAllResults();