app/Controllers/WeddingCertController.php

public function index()
    {
         // check if the user account is allowed to view marriage certificate
        if(!in_array(session()->get('userData')['userAccountType'], ['SIGNA', 'SIGNB', 'SIGNC', 'VIEWER', 'ENTRY'])){
            return redirect()->back()->with('error', 'You do not have permission to view this certificate.');
            exit();
        }


        $data['title'] = 'Marriage Certificates';
        $data['passLink'] = 'certificates';
        $data['branch_complete_certificate'] = $this->weddingCertModel
            ->join('branchs_table', 'branchs_table.branchId = marriage_certificates.cert_branch')
            ->where('marriage_certificates.cert_branch', session()->get('userData')['userBreanch'])
            ->where('marriage_certificates.SIGNA !=', null)
            ->where('marriage_certificates.SIGNB !=', null)
            ->where('marriage_certificates.SIGNC !=', null)
            ->orderBy('marriage_certificates.marriage_cert_id', 'DESC')
            ->findAll();

        $data['branch_uncomplete_certificate'] = $this->weddingCertModel
                ->join('branchs_table', 'branchs_table.branchId = marriage_certificates.cert_branch')
                ->where('marriage_certificates.cert_branch', session()->get('userData')['userBreanch'])
                ->groupStart()
                    ->where('marriage_certificates.SIGNA', null)
                    ->orWhere('marriage_certificates.SIGNB', null)
                    ->orWhere('marriage_certificates.SIGNC', null)
                ->groupEnd()
                ->orderBy('marriage_certificates.marriage_cert_id', 'DESC')
                ->findAll();
---
SELECT *
FROM `marriage_certificates`
JOIN `branchs_table` ON `branchs_table`.`branchId` = `marriage_certificates`.`cert_branch`
WHERE `marriage_certificates`.`cert_branch` = '1'
AND `marriage_certificates`.`SIGNA` IS NOT NULL
AND `marriage_certificates`.`SIGNB` IS NOT NULL
AND `marriage_certificates`.`SIGNC` IS NOT NULL
ORDER BY `marriage_certificates`.`marriage_cert_id` DESC

public function view($cert_id){

     // check if the user account is allowed to view marriage certificate
        if(!in_array(session()->get('userData')['userAccountType'], ['SIGNA', 'SIGNB', 'SIGNC', 'VIEWER', 'ENTRY'])){
            return redirect()->back()->with('error', 'You do not have permission to view this certificate.');
            exit();
        }


        $data['passLink'] = 'certificates';
        $data['certificate'] = $this->weddingCertModel
                                ->join('branchs_table', 'branchs_table.branchId = marriage_certificates.cert_branch')
                                ->join('login_users', 'login_users.userId = marriage_certificates.ENTRY')
                                ->where('marriage_certificates.marriage_cert_id', $cert_id)
                                ->first();
        if(empty($data['certificate'])){
            return redirect()->back()->with('error', 'certificate not found');
            exit();
        }

        $certificate = $data['certificate'];
        if(!(session()->get('userData')['userBreanch'] == $certificate['cert_branch'] || session()->get('userData')['userBreanch'] == 1)){
            return redirect()->back()->with('error', 'Your access to this document is not permissable.');
        }
         // check if the user account is allowed to view marriage certificate
        if(!in_array(session()->get('userData')['userAccountType'], ['SIGNA', 'SIGNB', 'SIGNC', 'VIEWER', 'ENTRY'])){
            return redirect()->back()->with('error', 'You do not have permission to view this certificate.');
---
SELECT *
FROM `marriage_certificates`
JOIN `branchs_table` ON `branchs_table`.`branchId` = `marriage_certificates`.`cert_branch`
JOIN `login_users` ON `login_users`.`userId` = `marriage_certificates`.`ENTRY`
WHERE `marriage_certificates`.`marriage_cert_id` = '7'
 LIMIT 1
SELECT *
FROM `branchs_table`